posts/monitor-mode-with-airmon-ng/index.html
<!DOCTYPE html>
<html lang="en" prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article#">
<head>
<meta charset="utf-8">
<meta content="Putting your device into monitor mode with airmon-ng." name="description">
<meta content="width=device-width, initial-scale=1" name="viewport">
<title>Monitor Mode With airmon-ng | The Cloistered Monkey</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<meta content="#5670d4" name="theme-color">
<meta content="Nikola (getnikola.com)" name="generator">
<link href="../../rss.xml" rel="alternate" title="RSS" type="application/rss+xml">
<link href="https://necromuralist.github.io/posts/monitor-mode-with-airmon-ng/" rel="canonical"><!--[if lt IE 9]><![endif]-->
<meta content="Cloistered Monkey" name="author">
<meta content="noindex" name="robots">
<meta content="The Cloistered Monkey" property="og:site_name">
<meta content="Monitor Mode With airmon-ng" property="og:title">
<meta content="https://necromuralist.github.io/posts/monitor-mode-with-airmon-ng/" property="og:url">
<meta content="Putting your device into monitor mode with airmon-ng." property="og:description">
<meta content="article" property="og:type">
<meta content="2018-05-12T18:00:48-07:00" property="article:published_time">
<meta content="wireless packets" property="article:tag">
</head>
<body>
<a class="sr-only sr-only-focusable" href="#content">Skip to main content</a> <!-- Menubar -->
<nav class="navbar navbar-expand-md static-top mb-4 navbar-light bg-light">
<div class="container"><!-- This keeps the margins nice -->
 <a class="navbar-brand" href="https://necromuralist.github.io/"><span id="blog-title">The Cloistered Monkey</span></a> <button aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation" class="navbar-toggler" data-target="#bs-navbar" data-toggle="collapse" type="button"><span class="navbar-toggler-icon"></span></button>
<div class="collapse navbar-collapse" id="bs-navbar">
<ul class="navbar-nav mr-auto">
<li class="nav-item"><a class="nav-link" href="../../archive.html">Archive</a></li>
<li class="nav-item"><a class="nav-link" href="../../categories/">Tags</a></li>
<li class="nav-item"><a class="nav-link" href="../../rss.xml">RSS feed</a></li>
<li class="nav-item dropdown"><a aria-expanded="false" aria-haspopup="true" class="nav-link dropdown-toggle" data-toggle="dropdown" href="#">Projects</a>
<div class="dropdown-menu"><a class="dropdown-item" href="https://necromuralist.github.io/In-Too-Deep/">In Too Deep (Neural Networks)</a> <a class="dropdown-item" href="../../machine-learning-projects/">Machine Learning</a> <a class="dropdown-item" href="https://necromuralist.github.io/student_intervention/">Student Intervention Project</a> <a class="dropdown-item" href="https://necromuralist.github.io/boston_housing/">Boston Housing Project</a> <a class="dropdown-item" href="https://necromuralist.github.io/data_science/">Data Science With Python</a></div>
</li>
</ul>
<!-- Google custom search -->
<form action="https://www.google.com/search" class="navbar-form navbar-right" method="get" role="search">
<div class="form-group"><input class="form-control" name="q" placeholder="Search" type="text"></div>
<!-- 
<button type="submit" class="btn btn-primary">
        <span class="glyphicon glyphicon-search"></span>
</button>
-->
<input name="sitesearch" type="hidden" value="https://necromuralist.github.io/"></form>
<!-- End of custom search -->
<ul class="navbar-nav navbar-right">
<li class="nav-item"><a class="nav-link" href="index.org" id="sourcelink">Source</a></li>
</ul>
</div>
<!-- /.navbar-collapse --></div>
<!-- /.container --></nav>
<!-- End of Menubar -->
<div class="container" id="content" role="main">
<div class="body-content"><!--Body content-->
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article">
<header>
<h1 class="p-name entry-title" itemprop="headline name"><a class="u-url" href=".">Monitor Mode With airmon-ng</a></h1>
<div class="metadata">
<p class="byline author vcard"><span class="byline-name fn" itemprop="author"><a href="../../authors/cloistered-monkey/">Cloistered Monkey</a></span></p>
<p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-05-12T18:00:48-07:00" itemprop="datePublished" title="2018-05-12 18:00">2018-05-12 18:00</time></a></p>
<p class="sourceline"><a class="sourcelink" href="index.org">Source</a></p>
</div>
</header>
<div class="e-content entry-content" itemprop="articleBody text">
<div class="outline-2" id="outline-container-orge3da9f9">
<h2 id="orge3da9f9">Introduction</h2>
<div class="outline-text-2" id="text-orge3da9f9">
<p>I'm looking into setting up a wireless (WiFi and bluetooth) monitoring station to collect data that correlates with how my network is performing and what the state of the network is and I thought that, as a first step, I'd get some <a href="https://en.wikipedia.org/wiki/Packet_analyzer">packet capturing</a> logs going. I'm primarily a python programmer who's kept my toe in the Linux command-line world but it's been a little while since I really dove into the wireless networking world. I had some vague notion about doing it with <a href="https://en.wikipedia.org/wiki/Wireless_tools_for_Linux">iwconfig</a> or <a href="https://wireless.wiki.kernel.org/en/users/documentation/iw">iw</a>, but then I found <a href="https://www.aircrack-ng.org/doku.php?id=airmon-ng">airmon-ng</a> and realized that it was what I was really looking for. Why is it better? Well, to be honest, I'm not informed enough to say that it's better, but when I tried to use <code>iw</code> it failed without really telling me why, while <code>airmon-ng</code> not only didn't fail, but it told me that there were other processes already using my wireless interface which is likely why <code>iw</code> failed and it told me how to fix it. On the one hand, since it's hiding so much from you <code>airmon-ng</code> lets you be a little ignorant and still do stuff, on the other - <b>what's wrong with that?</b></p>
</div>
</div>
<div class="outline-2" id="outline-container-orge7ae2b8">
<h2 id="orge7ae2b8">Setting Up</h2>
<div class="outline-text-2" id="text-orge7ae2b8">
<p>I'm using Ubuntu <a href="http://releases.ubuntu.com/18.04/">18.04 (Bionic Beaver)</a> - which seems to have both fixed and broken a surprising amount of stuff (nice that you let me log in with Dvorak now, but maybe you should let me know the keyboard layout has changed ahead of time) - so these instructions are based on that. First, <code>airmon-ng</code> is part of the <code>aircrack-ng</code> package so you need to install it to get what we want.</p>
<pre class="example">
sudo apt install aircrack-ng
</pre>
<p>Once you do this you'll see that <code>airmon-ng</code> is installed.</p>
<div class="highlight">
<pre><span></span>which airmon-ng
</pre></div>
<p>Interestingly, if you check it out, you'll see that all it is is a bash script.</p>
<div class="highlight">
<pre><span></span>file `which airmon-ng`
</pre></div>
<p>The file is kind of long.</p>
<div class="highlight">
<pre><span></span>wc -l `which airmon-ng`
</pre></div>
<p>So I won't list it here - you can check it out if you're interested. It's actually very informative if you want to learn how to do this kind of stuff, but for this case, we just need to know it works.</p>
</div>
</div>
<div class="outline-2" id="outline-container-orga85c263">
<h2 id="orga85c263">Monitor Mode</h2>
<div class="outline-text-2" id="text-orga85c263"></div>
<div class="outline-3" id="outline-container-org460d0c9">
<h3 id="org460d0c9">Starting Up Monitor Mode</h3>
<div class="outline-text-3" id="text-org460d0c9"></div>
<div class="outline-4" id="outline-container-org25d6642">
<h4 id="org25d6642">Finding your interface</h4>
<div class="outline-text-4" id="text-org25d6642">
<p>In the good old days you could be pretty sure that your wireless interface was <code>wlan0</code> (assuming you only had one) but then ubuntu/freedesktop went and <a href="https://www.freedesktop.org/wiki/Software/systemd/PredictableNetworkInterfaceNames/">changed things</a> so now you should probably check what your interface name is using <code>iw</code>.</p>
<div class="highlight">
<pre><span></span>iw dev
</pre></div>
<p>So it looks like we have a wireless interface named <code>wlp2s0</code> that we want to change from <b>managed</b> to <b>monitor</b> mode.</p>
</div>
</div>
</div>
<div class="outline-3" id="outline-container-org5c2973d">
<h3 id="org5c2973d">Okay, now monitor it</h3>
<div class="outline-text-3" id="text-org5c2973d">
<p>The syntax to start monitor mode is <code>airmon-ng start &lt;interface&gt;</code>.</p>
<pre class="example">
sudo airmon-ng start wlp2s0
</pre>
<pre class="example">
Found 5 processes that could cause trouble.
If airodump-ng, aireplay-ng or airtun-ng stops working after
a short period of time, you may want to run 'airmon-ng check kill'

  PID Name
 1505 wpa_supplicant
 1524 NetworkManager
 1541 avahi-daemon
 1748 avahi-daemon
 2298 dhclient

PHY     Interface       Driver          Chipset

phy0    wlp2s0          iwlwifi         Intel Corporation Wireless 7260 (rev 73)

                (mac80211 monitor mode vif enabled for [phy0]wlp2s0 on [phy0]wlp2s0mon)
                (mac80211 station mode vif disabled for [phy0]wlp2s0)
#+END_SRC

The first thing you should notice is that there are five potentially interfering processes. This is probably what interferes with the =iw= method, but we'll leave it alone and see if it works. Why don't we check on the interface.

#+BEGIN_SRC bash :results raw
iw dev
#+END_SRC

#+RESULTS:
phy#0
        Interface wlp2s0mon
                ifindex 5
                wdev 0x3
                addr 7c:5c:f8:f7:f5:c6
                type monitor
                channel 10 (2457 MHz), width: 20 MHz (no HT), center1: 2457 MHz
                txpower 0.00 dBm

So you can see that running =airmon-ng start= killed our original =wlp2s0= interface and replaced it with =wlp2s0mo= which is in monitor mode on channel 10. Unforturnately I wanted channel 6 but forgot to specify it. Let's try that again.

The first thing we have to do is to turn off monitor mode.

#+BEGIN_EXAMPLE
sudo airmon-ng stop wlp2s0mon
</pre>
<p>Note that we are stopping the new monitor-mode interface, not our original wireless interface. Now we can start the monitor-mode interface set to channel 6. The syntax is <code>airmon-ng start &lt;interface&gt; &lt;channel&gt;</code>.</p>
<pre class="example">
sudo airmon-ng start wlp2s0 6
#+END_SRC

There's some output from the command, but we want to know what =iw= thinks is going on.

#+BEGIN_SRC bash :results raw
iw dev
#+END_SRC

#+RESULTS:
phy#0
        Interface wlp2s0mon
                ifindex 7
                wdev 0x6
                addr 7c:5c:f8:f7:f5:c6
                type monitor
                channel 6 (2437 MHz), width: 20 MHz (no HT), center1: 2437 MHz
                txpower 0.00 dBm

So now we have an interface (=wlp2s0mon=) on channel 6 in monitor mode. We can make sure that it's working using [[https://tcpdump.org][tcpdump]].

#+BEGIN_EXAMPLE
sudo tcpdump -i wlp2s0mon -n
</pre>
<p>Note that we need to use the new interface name. Also, if it wasn't obvious up to now, putting the interface into monitor mode will break any networking capabilities for that interface on your computer (so if it was your internet connection, don't expect to access the web when it's in monitor mode).</p>
</div>
</div>
</div>
<div class="outline-2" id="outline-container-org022bb9f">
<h2 id="org022bb9f">Cleaning Up</h2>
<div class="outline-text-2" id="text-org022bb9f">
<p>We already got a preview of turning off monitor mode earlier. The syntax is <code>airmon-ng stop &lt;interface&gt;</code>.</p>
<pre class="example">
sudo airmon-ng stop wlp2s0mon
</pre>
<p>This will bring back the original wireless interface, but it won't (likely) re-establish your connection to your wireless access point. To get back onto the network you will probably need to open network manager and go through the setup process again.</p>
</div>
</div>
<div class="outline-2" id="outline-container-orgeb2d7b7">
<h2 id="orgeb2d7b7">Summary</h2>
<div class="outline-text-2" id="text-orgeb2d7b7">
<p>These were my notes on setting up monitor mode using <code>airmon-ng</code>. The main point I wanted to get across is how easy it is to do using <code>airmon-ng</code> as opposed to the other methods. I didn't actually show how much harder it is to use iwconfig, but if you have tried you might know what it entails. In any case, hopefully these notes will help me in the future as I keep watching the packets.</p>
</div>
</div>
</div>
<aside class="postpromonav">
<nav>
<ul class="tags" itemprop="keywords">
<li><a class="tag p-category" href="../../categories/wireless-packets/" rel="tag">wireless packets</a></li>
</ul>
</nav>
</aside>
</article>
<!--End of body content-->
<footer id="footer">Contents © 2019 <a href="mailto:necromuralist@protonmail.com">Cloistered Monkey</a> - Powered by <a href="https://getnikola.com" rel="nofollow">Nikola</a></footer>
</div>
</div>
<script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates -->
<script>

    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
</script><!-- end fancy dates -->
<script>

    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
</script>
</body>
</html>
